Revit 2026 API

# PulldownButtonAddSeparator Method

---

Adds a separator to the drop-down list.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void AddSeparator()
```
```vb
Public Sub AddSeparator
```
```cpp
public:
void AddSeparator()
```
```fsharp
member AddSeparator : unit -> unit
```

The separator will appear just below the last added PushButton.

#### Reference

PulldownButton Class

Autodesk.Revit.UI Namespace